_posts/2017-08-18-logic-mods.html
---
layout: post
title: "Logic"
date: 2017-08-18
comments: true
maths: true
tags: logic
excerpt: Logic rules
---

<p>
<b>Logic Rules</b>
</p>

<ul class="org-ul">
<li>Modus Ponens: If A then B</li>
<li>Moduls Tollens: If not B then not A</li>

<li>9 Axioms of set theory from Prof. Fredric Schuller</li>
</ul>
<p>
&#x2013; E
</p>


<p>
&#x2013; E
</p>


<p>
&#x2013; P
</p>


<p>
&#x2013; U
</p>


<p>
&#x2013; R
</p>


<p>
&#x2013; P
</p>


<p>
&#x2013; I
</p>


<p>
&#x2013; C
</p>


<p>
&#x2013; F
</p>

<p>
All of modern mathematics can be grounded without making any
conceptual assumptions except for the inclusion relation (a.k.a. the
epsilon relation or \(\epsilon\)–Relation) in axiomatic set
theory. To this concept are add nine axioms which allow to build up
the machinery for the advanced mathematics that theoretical physics
uses. To formulate these axioms propositional and predicate logic
provide the symbolic language we use. The nine axioms can be
abbreviated as <b><b>EE PURP
IC F</b></b>:
</p>

<p>
<b><b>Basic Existence Axioms</b></b>
</p>
